In [1]:
import pandas as pd

In [10]:
data = [{"Name":"Liza","Age":22},{"Name":"Ved","Age":23},{"Name":"Viggi","Age":24},{"Name":"Priyanshu","Age":23}]

In [11]:
df_1 = pd.DataFrame(data)

In [12]:
df_1.head()

        Name  Age
0       Liza   22
1        Ved   23
2      Viggi   24
3  Priyanshu   23

In [13]:
data2 = [{"Name":"X","Age":22},{"Name":"Y","Age":23},{"Name":"Z","Age":24},{"Name":"A","Age":23}]

In [18]:
df3 = pd.concat([df_1, df2], ignore_index=True)
df3

        Name  Age
0       Liza   22
1        Ved   23
2      Viggi   24
3  Priyanshu   23
4          X   22
5          Y   23
6          Z   24
7          A   23

In [14]:
df2 = pd.DataFrame(data2)

In [17]:
df2

  Name  Age
0    X   22
1    Y   23
2    Z   24
3    A   23

In [19]:
df4 = pd.DataFrame([{"Class":5, "Subject":"Maths"},{"Class":5, "Subject":"Science"},{"Class":5, "Subject":"Eng"}])

In [20]:
df4

   Class  Subject
0      5    Maths
1      5  Science
2      5      Eng

In [21]:
df5 = pd.concat([df3, df4], axis=0)

In [22]:
df5

        Name   Age  Class  Subject
0       Liza  22.0    NaN      NaN
1        Ved  23.0    NaN      NaN
2      Viggi  24.0    NaN      NaN
3  Priyanshu  23.0    NaN      NaN
4          X  22.0    NaN      NaN
5          Y  23.0    NaN      NaN
6          Z  24.0    NaN      NaN
7          A  23.0    NaN      NaN
0        NaN   NaN    5.0    Maths
1        NaN   NaN    5.0  Science
2        NaN   NaN    5.0      Eng

In [24]:
df_a = pd.DataFrame([{'Score':1, 'Age' : 22},{'Score':3, 'Age' : 53},{'Score':2, 'Age' : 40},{'Score':1, 'Age' : 18},{'Score':5, 'Age' : 65},{'Score':3, 'Age' : 46}])

In [25]:
df_a

   Score  Age
0      1   22
1      3   53
2      2   40
3      1   18
4      5   65
5      3   46

In [26]:
df_a['Score_Grade'] = df_a['Score'].map(lambda x: "A" if x == 1 else "B" if x == 2 else "C" if x == 3 else "D" if x == 4 else "E")

In [27]:
df_a

   Score  Age Score_Grade
0      1   22           A
1      3   53           C
2      2   40           B
3      1   18           A
4      5   65           E
5      3   46           C

In [28]:
df_a['Old_Young_Adult'] = df_a['Age'].map(lambda x : "Old" if x>55 else "Adult" if x>24 else "Young")
df_a

   Score  Age Score_Grade Old_Young_Adult
0      1   22           A           Young
1      3   53           C           Adult
2      2   40           B           Adult
3      1   18           A           Young
4      5   65           E             Old
5      3   46           C           Adult